# 2. Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# 1 - 1 * 1, 2 - 1 * 2, 3 - 1 * 2 * 3, 4 - 1 * 2 * 3 * 4 и т.д.
# - 4 -> [1, 2, 6, 24]
# - 6 -> [1, 2, 6, 24, 120, 720]

numb = int(input('write numb'))
count = 1
sum = 1

for i in range(1,numb+1):
    sum *=count 
    print(sum)
    count+=1

    
   
    
    
